/*1. Напишіть програму, яка використовує <QTextStream> для зчитування даних з текстового файлу. Програма повинна зчитувати кожен рядок з файлу та виводити його на екран консолі.

2. Напишіть програму, яка використовує <QTextStream> для запису даних у текстовий файл. Програма повинна запитувати користувача про введення рядка тексту, та записувати цей рядок у файл.

3. Напишіть програму, яка використовує <QTextStream> для зчитування даних з консолі та виводу їх на екран. Програма повинна чекати введення користувача та виводити введений рядок на екран.

4. Напишіть програму, яка використовує <QTextStream> для зчитування чисел з текстового файлу та знаходження їх середнього арифметичного. Програма повинна зчитувати кожне число з файлу та додавати його до змінної, яка зберігає загальну суму чисел. Після цього програма повинна обчислити середнє арифметичне за допомогою формули sum / n, де sum - загальна сума чисел, а n - кількість чисел.

5. Напишіть програму, яка використовує <QTextStream> для зчитування даних з текстового файлу та запису даних у інший текстовий файл. Програма повинна зчитувати кожен рядок з файлу та записувати його до нового файлу, при цьому замінюючи усі входження певного слова на інше слово. Слова для заміни програма повинна запитувати у користувача.*/
