#include "mainwindow.h"
#include "ui_mainwindow.h"

#include <QMessageBox>

MainWindow::MainWindow(QWidget *parent)
    : QMainWindow(parent)
    , ui(new Ui::MainWindow)
{
    ui->setupUi(this);
}

MainWindow::~MainWindow()
{
    delete ui;
}


void MainWindow::on_pushButton_clicked() //обробка події натиску на кнопку
{

    QString text = ui->lineEdit->text(); //QString text - створення змінної text яка має тип даних QString (текстовий). У цю змінну зберігається те, що було введено у текстове поле lineEdit. ui - звернення до екземпляру класу нашої форми, lineEdit - звернення до текстового поля на нашій формі, text() - метод текстового поля, який повертає текст, що був введений у ньому. Цей метод повертає значення з типом QString, саме тому значення зберігаємо у змінну з таким типом

    int a = text.toInt(); // конвертування текстового значення типу QString у тип цілого числа Int (для того, щоб працювати з введенним значенням, як з числом, виконувати математичні дії наприклад.
    a = a+20;

    QMessageBox::about(this, "Привіт", "Дякую, Ви ввели значення"); //звичайне інформаційне повідомлення. Приймає три параметри - this - посилання на поточну форму в якій ми працюємо, "Привіт" - заголовок віконця з повідомленням, "Дякую, Ви ввели значення" - сам текст повідомлення

    ui->label->setText(QString::number(a)); //вивід значення, яке ми отримали в результаті розрахунків у лейбл. Метод setText - приймає значення типу QString, яке потрібно відобразити. QString::number() - метод конвертування числа у текстовий тип QString (у якості параметра - саме число, в нашому випадку змінна а)
}

