#ifndef SPORTSMAN_H
#define SPORTSMAN_H

#include <iostream>
#include <string>
using namespace std;

class Sportsman
{
private:
    string name;
    int age;

public:
    Sportsman(string _name, int _age);
    void displayInfo();
};

#endif // SPORTSMAN_H



// #ifndef SPORTSMAN_H: Це скорочення від "if not defined" (якщо не визначено). Ця директива перевіряє, чи не визначений попередній макрос або ідентифікатор з іменем "SPORTSMAN_H". Якщо цей макрос не визначений, виконуються наступні рядки коду.
// #define SPORTSMAN_H: Якщо перевірка попередньої директиви вказує, що макрос "SPORTSMAN_H" не визначений, то цей рядок визначає макрос з іменем "SPORTSMAN_H". Визначення макросу вказує компілятору, що під час обробки коду цей макрос може використовуватися.
// Отже, ці рядки коду спільно використовуються для створення умови компіляції в коді. Це дозволяє уникнути проблем подвійного включення файлів заголовків (header files) під час компіляції програми. Якщо файл, який містить ці рядки, вже був включений раніше, то його вміст не буде повторно оброблятися.
